emacs/.emacs.d/init.el
;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
;;       in Emacs and init.el will be generated automatically!

;; You will most likely need to adjust this font size for your system!
(defvar efs/default-font-size 130)
(defvar efs/default-variable-font-size 130)

;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)



    ;; Make ESC quit prompts
    (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

    (use-package general
      :config
      (general-create-definer rune/leader-keys
	:keymaps '(normal insert visual emacs)
	:prefix ","
	:global-prefix "C-SPC")
      ;; map jk to esc in insert mode
      (general-def 'insert
	    "j" (general-key-dispatch 'self-insert-command
		      :timeout 0.2
		      "k" 'evil-normal-state))
      (rune/leader-keys
	"t"  '(:ignore t :which-key "toggles")
	"tt" '(counsel-load-theme :which-key "choose theme")
	"w" 'save-buffer
	"q" 'kill-buffer))

    (use-package evil
      :init
      (setq evil-want-integration t)
      (setq evil-want-keybinding nil)
      (setq evil-want-C-u-scroll t)
      (setq evil-want-C-i-jump t)
      ;; (setq evil-want-fine-undo 'fine)
      :config
      (evil-mode 1)
      ;;(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
      (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

      ;; Use visual line motions even outside of visual-line-mode buffers
      (evil-global-set-key 'motion "j" 'evil-next-visual-line)
      (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

      (evil-set-initial-state 'messages-buffer-mode 'normal)
      (evil-set-initial-state 'dashboard-mode 'normal))

    (use-package evil-collection
      :after evil
      :config
      (evil-collection-init))

;;redo undo
(use-package undo-tree
  :ensure t
  :init
  (setq undo-tree-history-directory-alist '(("." . "~/emacs.d/undo")))
  :config
  (global-undo-tree-mode))
(evil-set-undo-system 'undo-tree)

;; _ is not a keyword in word object, the following config can fix it.
(add-hook 'python-mode-hook #'(lambda () (modify-syntax-entry ?_ "w")))

(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room

(menu-bar-mode -1)            ; Disable the menu bar

;; Set up the visible bell
(setq visible-bell nil)

(column-number-mode)
(global-display-line-numbers-mode t)
(setq-default display-fill-column-indicator-column 79)  ; 80 column indicator - Emacs columns are 0-based...
(global-display-fill-column-indicator-mode t)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  treemacs-mode-hook
                  lisp-interaction-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0)))
  (add-hook mode (lambda () (display-fill-column-indicator-mode 0))))
(setq-default display-line-numbers-width 2)

  (use-package hl-fill-column)
  (global-hl-line-mode 1)
  (global-hl-fill-column-mode)

  (set-face-attribute 'hl-line nil :inherit nil :background "gray6")
  (set-face-attribute 'hl-fill-column-face nil :inherit nil :background "gray6")

  (use-package beacon)
  (beacon-mode 1)
  (use-package sublimity)
  (require 'sublimity-scroll)
  (sublimity-mode 1)
  ;; smooth scroll
  (setq sublimity-scroll-weight 10
      sublimity-scroll-drift-length 5)
  (setq scroll-conservatively 101) ; as long as it's > 100
  (setq scroll-preserve-screen-position t)

(set-face-attribute 'default nil :font "Caskaydia Cove Nerd Font" :height efs/default-font-size :weight 'light)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "Caskaydia Cove Nerd Font" :height efs/default-font-size)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Literata" :height efs/default-font-size :weight 'regular)
